//1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
let mas = [1, 20, 30, 40, 50, 60, 70, 80, 90, 10];
let result = mas[0]+mas[1]+mas[2]+mas[3]+mas[4]+mas[5]+mas[6]+mas[7]+mas[8]+mas[9];
console.log(result);
//2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
let book = {
    name: 'js',
    pages: 300,
    genre: 'detective',
};

//3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
let book1 = {
    name: 'js',
    pages: 300,
    genre: 'detective',
    autors: 'other',
};
//4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
let book2 = [
    'name', 'pages', 'genre', 'autors'
];
console.log(book);
console.log(book1);
console.log(book2);
//5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
//Значення площі зберігати в змінній s.
let h = 23;
let w = 10;
let s = h*w;
console.log(s)

//6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
//результат помістіть у змінну v.
let h3 = 10;
let d = 4;
let r = d/2;
const p = 3.14
let v = p*(r**2)*h3;
console.log(v)

//У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
//Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
let n = 3;
let m = 4;
let k = Math.sqrt(n**2+m**2);
console.log(k)