//- Користувач вводить або має два числа.
    //Потрібно знайти та вивести максимальне число з тих двох .
   // Також потрібно врахувати коли введені рівні числа.

let x = '-2';
let y = '2';
if (x===y){console.log('числа рівні')}
else if (x>y){console.log('максимальне число - x')}
else {console.log('максимальне число - y')}



//- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
//Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.


let flat = prompt('enter your flat');
if (flat>=1 && flat<=20){console.log('квартира в 1-му під.')}
else if (flat>=21 && flat<=48){console.log('квартира в 2-му під.')}
else if (flat>=49 && flat<=90){console.log('квартира в 3-му під.')}
else {console.log('невірно вказаний № квартири')}


//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number1 = +prompt('задайте числове значення');
if (number1===10){alert('Вірно')}else {alert('Невірно')}


//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//   якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
//якщо в змінну записали щось інше, спрацьовує else

let x1 = typeof 5;
if (x1==='number'){console.log(1)}
else if (x1==='string'){console.log(2)}
else if (x1==='symbol'){console.log(3)}
else if (x1==='object'){console.log(4)}
else{console.log('other')}


//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//    Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let t = prompt('яка сьогодні t');
if (t>=10 && t<=22){alert('ми йдемо ВЧИТИСЯ!!!')}
else {alert('сидимо вдома і вчимося ОНЛАЙН')}

//- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//    числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let a = prompt('вводимо число');
switch (a) {
    case '1':
        alert('Ви виграли Авто!!!');
        break;
    case '2':
        alert('Ви виграли Мото!!!');
        break;
    case '3':
        alert('Ви виграли Телефон!!!');
        break;
    case '4':
        alert('Ви виграли Подорож!!!');
        break;
    case '5':
        alert('Ви виграли Квитки!!!');
        break;
    default:
        alert('Нажаль, число не вірне!!!');
}

