//- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//    Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.


let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    alert('це великий масив, в якому  3 і більше елементи');
} else {
    alert('це маленький масив, в якому менше 3-х елементів')
}

//- Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//    Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = 16;
let b = 8;
let c = 10;
if (a>c && a<b){console.log('a')}
else if (b>a && b<c){console.log('b')}
else if (c>b && c<a){console.log('c')}


//- Перепишіть конструкцію if з використанням умовного оператора '?':
//let result;
//if (a + b < 4) {
//    result = 'Мало';
//} else {
//    result = 'Багато';
//}

let result  = (a + b < 4) ? 'Мало' : 'Багато';
console.log(result)


//- Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
//напишіть це тернарним оператором

let x = +prompt('ведіть число');
let y = (x === 0) ? 'нуль' :
    (x > (-100) && x < 0) ? "негативне" :
        (x > 0 && x <= 100) ? 'позитивне' : 'введіть інше число';
console.log(y)